{
  "backend/main.mo": "Backend actor defining user, brand, creator, collaboration, and payment types with Stripe integration, authorization, and storage mixins.",
  "feature_evidence.json": "Feature evidence report listing theme updates, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend files and components.",
  "frontend/index.css": "Global CSS defining pastel OKLCH design tokens for light/dark themes and applying base Tailwind resets.",
  "frontend/index.html": "HTML entry point mounting the app root and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and wrapping the app in ThemeProvider and Toaster.",
  "frontend/src/components/Footer.tsx": "Footer component with wordmark, navigation links, contact info, and social media icons.",
  "frontend/src/components/Header.tsx": "Renders the site header with navigation, login/logout handling, and mobile menu logic tied to Internet Identity and user roles.",
  "frontend/src/components/Layout.tsx": "Wraps pages with a header, footer, and main content area using a flex column layout.",
  "frontend/src/components/marketing/HowItWorks.tsx": "Displays a list of numbered marketing steps with titles and descriptions.",
  "frontend/src/components/marketing/MarketingLayout.tsx": "Provides a simple wrapper container for marketing pages.",
  "frontend/src/components/marketing/SocialProofStrip.tsx": "Shows a three‑column statistics strip with icons for creators, campaigns, and brands.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context using Internet Identity, providing identity state, login, and logout logic.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user, brand, and creator profiles through the backend actor.",
  "frontend/src/index.css": "Configures Tailwind styles, theme variables, dark mode tokens, and marketing component classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/BrandDashboardPage.tsx": "Brand dashboard showing campaign stats, creator search with filters, and sending collaboration requests with payment flow.",
  "frontend/src/pages/CreatorDashboardPage.tsx": "Creator dashboard displaying profile and stats, with functionality to edit profile details and upload a profile picture.",
  "frontend/src/pages/ForBrandsPage.tsx": "Marketing page explaining features and workflow for brands, with CTAs to sign up or view a demo.",
  "frontend/src/pages/ForCreatorsPage.tsx": "Marketing page outlining benefits and steps for creators, including CTAs to join the platform or learn more.",
  "frontend/src/pages/HomePage.tsx": "Landing page highlighting platform value, how it works, and navigation prompts for signup or brand information.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity, redirecting users based on role and providing a button to initiate login.",
  "frontend/src/pages/SignUpPage.tsx": "Provides brand and creator signup forms with Internet Identity auth, profile picture upload, and mutation calls to register accounts.",
  "frontend/src/utils/currency.ts": "Utility functions for formatting numbers and bigints as USD currency strings.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and persisting URL parameters via query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, and layout settings with plugins enabled.",
  "project_state.json": "Describes the project's architecture, features, and known issues for the IC-based influencer marketing platform."
}